test_mix/oneParticlesSediment_silicon_oil_cfdemSolverMix/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
  (0   0   0)
  (0.1 0   0)
  (0.1 0.1 0)
  (0   0.1 0)
  (0   0   0.16)
  (0.1 0   0.16)
  (0.1 0.1 0.16)
  (0   0.1 0.16)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 96) simpleGrading (1 1 1)
);

edges
(
);

patches
(
  wall inlet
  (
    (0 3 2 1)
  )
  wall wall 
  (
    (2 6 5 1)
    (0 4 7 3)
    (3 7 6 2)
    (1 5 4 0)
  )
  wall outlet
  (
    (4 5 6 7)
  )
  /*
  empty frontAndBack
  (
    (0 3 2 1)
    (4 5 6 7)
  )
   */
);

mergePatchPairs
(
);
